app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @activity = Activity.find_by(id: params[:id])

INSERT INTO "activities" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Piano"], ["created_at", "2022-02-03 05:19:46.020303"], ["updated_at", "2022-02-03 05:19:46.020303"]]
---
  def create
    @activity = Activity.new(activity_params)

    if @activity.save

UPDATE "activities" SET "title" = ?, "updated_at" = ? WHERE "activities"."id" = ?  [["title", "Piano1"], ["updated_at", "2022-02-03 05:14:37.416650"], ["id", 212]]
---
  def update
    if @activity.update(activity_params)

DELETE FROM "activities" WHERE "activities"."id" = ?  [["id", 212]]
---
  def destroy
    if @activity.destroy