app/controllers/childenrolls_controller.rb

SELECT "childenrolls".* FROM "childenrolls"
---
  def index
    @childenrolls = Childenroll.all

SELECT "childenrolls".* FROM "childenrolls" WHERE "childenrolls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @childenroll = Childenroll.find_by(id: params[:id])

INSERT INTO "childenrolls" ("name", "created_at", "updated_at", "activity_id") VALUES (?, ?, ?, ?)  [["name", "max"], ["created_at", "2022-02-25 21:16:30.977910"], ["updated_at", "2022-02-25 21:16:30.977910"], ["activity_id", 119]]
---
  def create
    # byebug
    @childenroll = Childenroll.new(childenroll_params)

    if @childenroll.save

DELETE FROM "childenrolls" WHERE "childenrolls"."id" = ?  [["id", 1]]
---
  def destroy
    if @childenroll.destroy

SELECT "childenrolls".* FROM "childenrolls" WHERE "childenrolls"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_childenroll
      @childenroll = Childenroll.find(params[:id])